#include <stdio.h>

int main() {
    
    printf("เตรียมอุปกรณ์ครัว: กระทะ, เขียง, มีด, ตะหลิว\n");

    printf("เตรียมวัตถุดิบ: ข้าวสวย, หมูกรอบ, ไข่เยี่ยวม้า\n");

    printf("เตรียมเครื่องปรุง: กระเทียม, พริก, น้ำมัน, กระเพรา,หมูกรอบหั่น\n");

    printf("---- เริ่มทำอาหาร ----\n");

    printf("ทอดหมูกรอบจนกรอบพอเหมาะ\n");
 
    printf("ปรุงรสที่ชอบแล้วนำหมูกรอบขึ้นมาพักไว้\n");
    
    printf("ใส่หมูกรอบกลับสักครู่จนมีกลิ่นหอม\n");

    printf("จัดข้าวใส่จาน\n");

    printf("จัดไข่เยี่ยวม้าด้านข้างจาน\n");

    printf("ยกหมูไข่เยี่ยวม้า\n");

    printf("ผัดกระเทียมและพริกในน้ำมันจนหอม\n");

    printf("ใส่หมูกรอบลงผัดให้เข้ากัน\n");

    printf("ใส่กระเพรา\n");

    printf("---- เสร็จสิ้นการทำอาหาร ----\n");

    return 0;
}
